3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_0p5_s12p5/0/domain2/U
FoamFile
{
    version 2.0; format ascii;
    class volVectorField; location "0/domain2"; object U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.001 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (0.001 0 0); }
    outlet { type zeroGradient; }
    domain2_to_solid_wall { type noSlip; }
}
